[
  {
    "id": 1,
    "title": "Uploaded: reading1.pdf - Part 1",
    "content": "Journal of Social Sciences, Literature and Languages \nAvailable online at jssll.blue-ap.org \n©2015 JSSLL Journal. Vol. 1(1), pp. 9-16, 30 April, 2015 \nReview of Constructivism and Social Constructivism \n \nRoya Jafari Amineh1* and Hanieh Davatgari Asl2 \n \n1. Ph.D. Candidate in TEFL, Department of English Language Teaching, Ahar Branch, Islamic Azad \nUniversity, Ahar, Iran \n2. Ph.D.  in TEFL, Department of English Language Teaching, Ahar Branch, Islamic Azad University Ahar, \nIran \n  \nCorresponding Author: Roya Jafari Amineh \n \nReceived:  20 March, 2015                Accepted: 11 April, 2015                   Published: 30 April, 2015 \n \nA B S T R A C T   \nAlthough constructivism is a concept that has been embraced recently, a great number of sociologists, psychologists, applied linguists, and teachers \nhave provided varied definitions of this concept. Also many philosophers and educationalists such as Piaget, Vygotsky, and Perkins suggest that",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 2,
    "title": "Uploaded: reading1.pdf - Part 2",
    "content": "have provided varied definitions of this concept. Also many philosophers and educationalists such as Piaget, Vygotsky, and Perkins suggest that \nconstructivism and social constructivism try to solve the problems of traditional teaching and learning. This research review represents the meaning and \nthe origin of constructivism, and then discusses the role of leaning, teaching, learner, and teacher in the first part from constructivist perspective. In the \nsecond part, the paper discusses the same issues, as presented in the first part, from social constructivist perspective. The purpose of this research review \nis to make EFL teachers and EFL students more familiar with the importance and guidance of both constructivism and social constructivism perspectives. \nKeywords: Constructivism, Social, Constructivism. \n©2015 JSSLL Journal All rights reserved. \n \n \nINTRODUCTION \n \n1.1. Origin of Constructivism",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 3,
    "title": "Uploaded: reading1.pdf - Part 3",
    "content": "Keywords: Constructivism, Social, Constructivism. \n©2015 JSSLL Journal All rights reserved. \n \n \nINTRODUCTION \n \n1.1. Origin of Constructivism  \n Although it has become popular only recently, the origins of constructivism are believed to date back to the time of Socrates, \nwho claimed that teachers and learners should talk with each other and interpret and construct the hidden knowledge by asking \nquestions (Hilav, 1990, cited in Erdem, 2001). Gruber and Voneche (1977) also state that the term constructivism most probably \nis derived from Piaget’s “constructivist” views (1967), as well as from Bruner’s (1996) “constructivist” description of discovery \nlearning. \n Furthermore, Perkins (1992) points out that constructivism has multiple roots in psychology and philosophy of this century: \nthe developmental perspective of Jean Piaget (1969) and the emergence of cognit ive psychology under the guidance of figures \nlike Jerome Bruner (1966). \n \n1.2. What is constructivism?",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 4,
    "title": "Uploaded: reading1.pdf - Part 4",
    "content": "the developmental perspective of Jean Piaget (1969) and the emergence of cognit ive psychology under the guidance of figures \nlike Jerome Bruner (1966). \n \n1.2. What is constructivism? \n Constructivism is a synthesis of multiple theories diffused in to one form. It is the assimilation of both behaviorialist and  \ncognitive ideals. The “constructivist stance maintains that learning is a process of constructing meaning; it is how people make \nsense of their experience” (Merriam and Caffarella, 1999, p. 260). \n Mvududu and Thiel-Burgess (2012) state that constructivism is widely touted as an appr oach to probe for children’s level \nof understanding and to show that that understanding can increase and change to higher level thinking. Thus, constructivism \nrefers to how of learning and thinking .Constructivism describes the way that the students can ma ke sense of the material and",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 5,
    "title": "Uploaded: reading1.pdf - Part 5",
    "content": "refers to how of learning and thinking .Constructivism describes the way that the students can ma ke sense of the material and \nalso how the materials can be taught effectively. With Constructivism as an educational theory in mind, the teachers should \nconsider what students know and allow their students to put their knowledge in to practice.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 6,
    "title": "Uploaded: reading1.pdf - Part 6",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n10 | P a g e  \n Kanselaar (2002) stated that there are two major strands of constructivist perspective, (a) constructivist perspective and (b) \nsocial-cultural perspective (Socio-constructivist perspective). \n a.Cognitive constructivism, an individualistic perspective is based on th e work of Swiss developmental psychologist Jean \nPiaget. Piaget's theory includes two major parts, a\"ages and stages\" component that predicts what children can and cannot \nunderstand at different ages, and a” theory of development” that describes how children develop cognitive abilities. Piaget (1977) \nasserts that learning does not occur passively; rather it occurs by active construction of meaning. He explains that when we,  as \nlearners, encounter an experience or a situation that challenges the way we think, a state of disequilibrium or imbalance is created.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 7,
    "title": "Uploaded: reading1.pdf - Part 7",
    "content": "learners, encounter an experience or a situation that challenges the way we think, a state of disequilibrium or imbalance is created. \nWe must then alter our thinking to restore equilibrium or balance. For this purpose, we make sense of the new information by \nassociating it with what we already know, that is, by attempting to assimilate it into our existing knowledge. When we are unable \nto do this, we use accommodation by restructuring our present knowledge to a higher level of thinking.  b.social-cultural \nconstructivism (Socio-constructivist perspective) \n Lev Vygotsky’s (1986-1934) main relevance to constructivism comes from his theories about language, thought, and their \nmediation by society. Vygotsky holds an anti -realist position and states that the process of knowing is affected by other people \nand is mediated by community and culture. \n An important part of Vygotsky’s work (1986) is critical upon Piaget’s contribution to constructivism. While Piaget believes",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 8,
    "title": "Uploaded: reading1.pdf - Part 8",
    "content": "and is mediated by community and culture. \n An important part of Vygotsky’s work (1986) is critical upon Piaget’s contribution to constructivism. While Piaget believes \nthat development precedes learning, Vygotsky believes the opposite. On the topic of the development of speech, Piaget said that \nthe children’s egocentric speech goes away with maturity and is the transformed in to social speech. On the contrary, Vygotsky \nstated that the child’s mind is inherently social in nature and so speech moves from communicative social to inner egocentric . \nTherefore, since the development of thought follows the development of speech, Vygotsky claims that thought develops from \nsociety to the individual and not the other way. \n \n1.2. Constructivism in practice \n Constructivism as an educational theory holds that teachers should first consider  their students’ knowledge  and allow them",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 9,
    "title": "Uploaded: reading1.pdf - Part 9",
    "content": "1.2. Constructivism in practice \n Constructivism as an educational theory holds that teachers should first consider  their students’ knowledge  and allow them \nto put that knowledge in to practice (Mvududu & Thiel -Burgess ,2012) .In other words, Mvududu and Thiel -Burgess represent \nconstructivist view as one of the leading theoretical positions in ed ucation. Since there is no universal definition of \nconstructivism, some consider it as a theory of learning, others as a theory of knowledge; although some other scholars and \ntheorists consider it as a theory of pedagogy. Additional views are theory of sci ence, educational theory or an all-encompassing \nworldview. \n Cooper (1993) states that like psychology, there has been a paradigm shift in the designed instruction which can be described \nas a shift from behaviorism to cognitivism and then from cognitivism t o constructivism. This paradigm shift indicated that the",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 10,
    "title": "Uploaded: reading1.pdf - Part 10",
    "content": "as a shift from behaviorism to cognitivism and then from cognitivism t o constructivism. This paradigm shift indicated that the \nfield of education itself has undergone a significant shift in the nature of human learning and the conditions that best prom ote \nthe different conditions of learning. Cooper also proposes that constructivist perspective on learning have become so influential \nin the past twenty years that they represent a paradigm shift in the epistemology of knowledge and theory of learning.  \nPhillips (2000) writes about a number of constructivist traditions. He propos es that educational constructivism itself includes a \nnumber of variations and the two most popular types of these variations are: \n1) Jean Piaget’s personal constructivis \n2) Lev Vygotsky’s social constructivism \n Piaget and Inhelder (1969) suggest that discovery is the most important and fundamental basis of learning. While Vygotsky",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 11,
    "title": "Uploaded: reading1.pdf - Part 11",
    "content": "2) Lev Vygotsky’s social constructivism \n Piaget and Inhelder (1969) suggest that discovery is the most important and fundamental basis of learning. While Vygotsky \n(1978) believes that Piaget’s emphasis focuses too much on internal processes of individuals. Vygotsky considers cognitive \ndevelopment primarily as a function of external factors such as cultural, historical, and social interaction rather than of individual \nconstruction. Vygotsky believes that people master their behavior through psychological tools and he introduces language as the \nmost important psychological tool. \n Many educators such  as Bailey and Pransky (2005) agree with Vygotsky (1978) about the importance of culture in \nconstruction of knowledge, yet Bailey and Pransky (2005) emphasize that pedagogical theories such as constructivism don’t \nconsider the deep impact of culture on learning and knowledge.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 12,
    "title": "Uploaded: reading1.pdf - Part 12",
    "content": "construction of knowledge, yet Bailey and Pransky (2005) emphasize that pedagogical theories such as constructivism don’t \nconsider the deep impact of culture on learning and knowledge. \n However, the following parts show whether knowledge is viewed as individual construction has implications for the ways \nin which learning is conceptualized, it has implications for the ways in which learning is conceptualized (Mvududu & Thiel-\nBurgess , 2012). \n \n1.3. Constructivist view of learning \n Due to complexities and diversity of perspectives on constructivism, Hoover (1969) introduces a common set of principles \nfor these perspectives that can be operationalized. Hoover expressed two important notions which encompass the simple idea of \nconstructed knowledge. The first notion is that learners construct new understandings using their current knowledge. In other \nwords, the learners’ prior knowledge influences their new knowledge.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 13,
    "title": "Uploaded: reading1.pdf - Part 13",
    "content": "constructed knowledge. The first notion is that learners construct new understandings using their current knowledge. In other \nwords, the learners’ prior knowledge influences their new knowledge.  \n The second notion is that learning is not passive. Instead learning is an active process in which learners negotiate their \nunderstanding in the light of what they experience in the new learning situation. If what learners encounter is not consistent with",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 14,
    "title": "Uploaded: reading1.pdf - Part 14",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n11 | P a g e  \ntheir current understanding, their current knowledge can change in order to accommodate new experience. Thus learners cannot \nbe passive and they remain active throughout this process. \n Cook (1992) also advocates the use of negotiation in the curriculum .When learners negotiate, ask questions, and try hard \nto find the answers themselves, what they learn will be more meaningful to them (Cook,1992).It this curriculum, a sense of \nownership in learners for their work and a commitment to their learning can occur.  \n Bruner (1992) comments on negotiating the curriculum as Negotiating the curriculum means deliberately planning to invite \nstudents to contribute, and to modify, the educational program, so that they will have a real investment both in the learning  \njourney and the outcomes. Negotiation also means making explicit, and then confronting, the constraints of the learning context",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 15,
    "title": "Uploaded: reading1.pdf - Part 15",
    "content": "journey and the outcomes. Negotiation also means making explicit, and then confronting, the constraints of the learning context \nand the non-negotiable requirements that apply. (p. 14)  \n Twomey Fosnot (1989) defines constructivism according to four principles: (1) learning depends on what individuals \nalready know, (2) new ide as occur as individuals adapt and change their old ideas, (3) learning involves inventing ideas rather \nthan mechanically accumulating a series of facts, (4) meaningful learning occurs through rethinking old ideas and coming to \nnew conclusions about new ideas which conflict with our old ideas. \n In constructivism, learning is represented as a constructive process in which the learner is building an internal illustratio n \nof knowledge, a personal interpretation of experience. This representation is always open to modification, its structure and",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 16,
    "title": "Uploaded: reading1.pdf - Part 16",
    "content": "of knowledge, a personal interpretation of experience. This representation is always open to modification, its structure and \nlinkages forming the ground to which other knowledge structures are attached. Learning is then an active process in which \nexperience has an important role in understanding and grasping the meaning. This view of knowledge does not necessarily reject \nthe existence of the real world, instead it agrees that reality places constrains on the existing concepts, and contends that  all \nindividuals’ knowledge of the world is the interpretations of their experiences. Furthermore, conc eptual growth is the result of \nvarious perspectives and the simultaneous changing of individuals’ internal representations in response to those perspectives  as \nwell as through their experience (Bednar, Cunnigham, Duffy, Perry, 1995 cited in Duffy and Jonas sen,1991).",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 17,
    "title": "Uploaded: reading1.pdf - Part 17",
    "content": "well as through their experience (Bednar, Cunnigham, Duffy, Perry, 1995 cited in Duffy and Jonas sen,1991).  \n Christie (2005) point out that constructivism is a learning theory in which learning is both an active process and a personal  \nrepresentation of the world. In this theory, knowledge is constructed from the experience and is modified through dif ferent \nexperiences. Problem solving and understanding are emphasized in this theory. Authentic tasks, experiences, collaboration, an d \nassessment are among other important factors in this view of learning. \n Hare , (2005) state that learner -centric instructi onal classroom methods are emphasized in the constructivist learning \napproach. Also Hare , argue that educators who follow this approach must build their school curriculum around the experience \nof their students. Hare  state that there is a trend for incorporating technology into the classrooms in order to support instructional",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 18,
    "title": "Uploaded: reading1.pdf - Part 18",
    "content": "of their students. Hare  state that there is a trend for incorporating technology into the classrooms in order to support instructional \nlearning methods. However recent studies have revealed that technology is not efficiently integrated with the constructivism and \nconstructivist leaning. \n Piaget’s constructivism whic h is based on his view of children’s psychological development insists that discovery is the \nbasis of his theory. Piaget (1973) argues that to understand means to discover or reconstruct by means of rediscovery . Piaget \ndiscusses that children go through st ages in which they accept ideas they may later change or do not accept. Therefore, \nunderstanding is built up step by step through active participation and involvement and learners cannot be considered as passive \nin any of the steps or stages of development.  \n Contrary to Piaget, Bruner (1973) states that learning is a social process, whereby students construct new concepts and",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 19,
    "title": "Uploaded: reading1.pdf - Part 19",
    "content": "in any of the steps or stages of development.  \n Contrary to Piaget, Bruner (1973) states that learning is a social process, whereby students construct new concepts and \nknowledge based on their current knowledge. In this view of constructivism, the student selects information, constructs \nhypotheses, and makes decisions, with the aim of integrating new experiences into his existing knowledge and experience. \nBruner emphasizes the role of cognitive structures for providing meaning and organization of experiences and suggest learners  \nto transcend the boundaries of the given information. For him, learner independence lies at the heart of effective education and \nhe argues that this independence can be increased when the students try to discover new principles of their own. Moreover, \ncurriculum should be organized in a spiral manner so that students can build upon what they have already learned.  \n \n1.4. Constructivist view of teaching",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 20,
    "title": "Uploaded: reading1.pdf - Part 20",
    "content": "curriculum should be organized in a spiral manner so that students can build upon what they have already learned.  \n \n1.4. Constructivist view of teaching \n According to Prawat (1992), most of the interpretations of the meaning of constructivist theory agree that it involves a \ndramatic change in the focus of teaching and puts the students’ own efforts to understand at the centre of the educational \nenterprise. \n Gray (1997) proposes that constructivist teaching is based on the learning that occurs through learners’ active involvement \nin construction of meaning and knowledge. Constructivist teaching just promotes learners’ motivation and critical thinking, and \nencourages them to learn independently.  \n Hoover (1996) argues that constructivism has important implications for teaching. First, te aching cannot be viewed as the \ntransmission of knowledge form enlightened or known to unenlightened or unknown. Constructivist teachers are not monologue",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 21,
    "title": "Uploaded: reading1.pdf - Part 21",
    "content": "transmission of knowledge form enlightened or known to unenlightened or unknown. Constructivist teachers are not monologue \nteachers who just teach completely new lessons. Rather constructivist teachers have the role of guides  for the students and \nprovide their students with opportunities to test the adequacy of their current understandings.  \n Second, constructivist teachers consider the prior knowledge of their learners and provide learning environments that exploit \ninconsistencies between learners’ current knowledge and their new experiences (Clements, 1997; Hoover, 1996). The difference",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 22,
    "title": "Uploaded: reading1.pdf - Part 22",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n12 | P a g e  \nbetween learners challenges the teachers and does not allow them to use the same method or the same materials while teaching \nto these students. \n Third, since learners’ involvement is emphasized in the constructivism, the teachers must engage students in learning, and \nbring their students’ current understanding to the forefront (Hoover, 1996). Constructivist teachers can ensure that learning  \nexperiences include problems that are important to the students, and are not just related to the needs and interests of teachers and \nthe educational system. \n Fourth, Hoover (1996) reminds that sufficient time is needed to build the new knowledge actively. Duri ng this time, the \nstudents reflect on their new experiences and try to consider the relationship between these experiences and the previous ones in \norder to have an improved (not “correct”) view of the world.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 23,
    "title": "Uploaded: reading1.pdf - Part 23",
    "content": "students reflect on their new experiences and try to consider the relationship between these experiences and the previous ones in \norder to have an improved (not “correct”) view of the world. \n Similar to the effect of negotiation as an imp ortant aspect of a constructivist classroom on learning, negotiation also unites \nteachers and students in a common purpose. Smith (1993) confirms that negotiating curriculum means \"custom-building classes \nevery day to fit the individuals who attend\" (p. 1). Bruner (1992) reminds that teachers must talk openly about the new knowledge \nand constraints in the negotiations.  \n \n1.5. Constructivist view of the learner \n Constructivism believes that learner’s conceptions of knowledge are derived from a meaning -making search in which \nlearners construct individual interpretations of their experiences. The learners’ constructions during the examination, questioning",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 24,
    "title": "Uploaded: reading1.pdf - Part 24",
    "content": "learners construct individual interpretations of their experiences. The learners’ constructions during the examination, questioning \nand analyzing of tasks and experiences yield knowledge whose correspondence to external reality may have little verisimilitude. \nHowever, most of the learners’ constructions is filtered through a process of social negotiation or distributed cognition (Br own, \nA.L., Ash,D., Rutherfored, M., Nakagawa, K., Gordon, A., and Campione, J.C., 1995).  \n Applefield, Huber, and Moallem (2000) point out that the role of the learner in constructivism is conceived as building and \ntransforming knowledge. Although Applefield, Huber, and Moallem remind that there are different notions of the nature of \nknowledge and knowledge construc tion process, Moshman (1982) identifies three types of constructivism as exogenous \nconstructivism, endogenous constructivism and dialectical constructivism.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 25,
    "title": "Uploaded: reading1.pdf - Part 25",
    "content": "knowledge and knowledge construc tion process, Moshman (1982) identifies three types of constructivism as exogenous \nconstructivism, endogenous constructivism and dialectical constructivism.  \n Exogenous constructivism, which is related with philosophy of reality, proposes that the learner constructs and reconstructs \nmental representations which reflect the organization of the world. In this view, the learners’ schemata and networks of \ninformation are based on the external realities of the environment that they experience.  \n Endogenous or cognitive constructivism is based individual construction of knowledge   (Cobb, 1994; Moshman, 1982).This \ntype of constructivism is derived from Piagetian theory (1977, 1970) and describes how individuals can resolve mental \ndisequilibrium when they encounter i nternal cognitive conflict. Learners’ negotiation on the meaning of their experiences and",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 26,
    "title": "Uploaded: reading1.pdf - Part 26",
    "content": "disequilibrium when they encounter i nternal cognitive conflict. Learners’ negotiation on the meaning of their experiences and \nuse of individual or socially mediated discovery-oriented learning activities are emphasized in this perspective. \n Furthermore, Applefield, Huber, and Moallem (2000)  introduce the importance of collaborative social interaction and \ncontext in social or dialectic constructivism. Social constructivism represents the most general extant perspective of \nconstructivism with its emphasis on social exchanges for learners’ cogn itive growth and role of culture and history in their \nlearning. \n \n1.6. Constructivist view of teacher \n In constructivism, teachers and peers support and contribute to learning through the concepts of scaffolding, cognitive \napprenticeship, tutoring, and cooperative learning and learning communities (Brown, 1994 & Rogoff, 1998).",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 27,
    "title": "Uploaded: reading1.pdf - Part 27",
    "content": "apprenticeship, tutoring, and cooperative learning and learning communities (Brown, 1994 & Rogoff, 1998).   \n In a constructivist classroom, teachers create situations in which the students will question their own and each other's \nassumptions. So a constructivist teacher needs to create situatio ns that challenge the assumptions of traditional teaching and \nlearning. Belenky, Clinchy, Goldberger, and Tarule (1986) cited in Gray (1997) report that at the constructivist level of knowing \nand thinking, we always reevaluate our assumptions about knowled ge; our attitude towards \"the expert\" is transformed; we do \nnot have any problem by ambiguity but are enticed by complexity; and we take on a never -ending quest for truth and learning \nwhere truth is seen as a process of construction in which the knower participates. A constructivist teacher's perception of expertise",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 28,
    "title": "Uploaded: reading1.pdf - Part 28",
    "content": "where truth is seen as a process of construction in which the knower participates. A constructivist teacher's perception of expertise \nin the classroom is based on the experience of his or her students in interaction with each other and with their teacher, and his or \nher tolerance of ambiguity is high as evidenced in the tendency to create complexity \n Lester and Onore (1990) indicate that teachers' personal beliefs about teaching (their construct systems) are important and \ndetermine the kinds and extents of changes they are able to make. Also Lester and Onore state that teachers  view teaching and \nthe situation through the lens of their personal construct system. Thus the main construct affecting a teacher's ability to t each in \na transactional, constructivist way is the belief that knowledge is constructed by human beings. Further , teachers would need to \nmake a shift in thinking and change what they believe about knowledge in order to really change their teaching.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 29,
    "title": "Uploaded: reading1.pdf - Part 29",
    "content": "make a shift in thinking and change what they believe about knowledge in order to really change their teaching.  \n According to Mezirow(1990) cited in Gray(1997), reflecting on teaching practice contributes to the teacher’s ability to cross \nthe bridge in terms of how he or she thinks and believes about teaching. This enables the teacher to move, for example, from a \ntransmissional instructional practice which is common in the traditional teaching to a constructivist and transactional one which",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 30,
    "title": "Uploaded: reading1.pdf - Part 30",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n13 | P a g e  \nis the purpose of constructivism).Reflection  also involves a critique of the assumptions on which the teachers’ beliefs have been \nbuilt, and through reflection, their perspectives are transformed  \n Lester and Onore (1990) propose that genuine le arning or change does not comes from ignoring all prior learning in order \nto relearn, but \"from questioning or reassessing our existing beliefs about the world\" (p. 41):  \n Change can occur through having experiences that present and represent alternative s ystems of beliefs and trying to find a \nplace for new experiences to fit into already held beliefs (p. 41).  \n Giroux (1986) notes that teachers are often trained to use various models of teaching and evaluation, yet are not taught to \nbe critical of the assu mptions that underlie these models. He advises that teachers must be more than technicians but \ntransformative intellectuals engaging in a critical dialogue among them.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 31,
    "title": "Uploaded: reading1.pdf - Part 31",
    "content": "be critical of the assu mptions that underlie these models. He advises that teachers must be more than technicians but \ntransformative intellectuals engaging in a critical dialogue among them.  \n Lester and Onore (1990) note that holding a constructivist view of knowledge can enable a teacher to explore and form new \nideas about teaching and learning. But the teacher’s job in holding this view may need more attention when he or she has to \nconsider all that impinges on teaching such as the existing school system and its policies, and the school culture. \n As one of the instances of the effect of constructivism on teaching, Carpenter and Fennema (1992) in their Cognitively \nGuided Instruction (CGI) of mathematic program stated that elementary school teachers were given extensive training in \nconstructivist methods  such as complex problems, modeling, group problem solving, and teaching of metacognitive strategies",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 32,
    "title": "Uploaded: reading1.pdf - Part 32",
    "content": "constructivist methods  such as complex problems, modeling, group problem solving, and teaching of metacognitive strategies \nand these teachers have improved in higher level thinking skills as well as solid achievements in traditional computational skills. \nNeale, Smith,and Johnson (1990) declare that in addition to positive outcomes of constructivism in science (Neale, Smith, & \nJohnson,1990), similar successes have been reported in reading (Duffy & Roehler, 1986) and in writing (Bereiter & Scardamalia, \n1987). \n \n2.1. What is Social constructivism? \n Social constructivism is a theory of knowledge in sociology and communication theory that examines the knowledge and \nunderstandings of the world that are developed jointly by individuals. This theory assumes that understanding, significance, and \nmeaning are developed in coordination with other human beings. The most important elements in this theory are (a) the",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 33,
    "title": "Uploaded: reading1.pdf - Part 33",
    "content": "meaning are developed in coordination with other human beings. The most important elements in this theory are (a) the \nassumption that human beings rationalize their experience by creating a model of the social world and the way that it functions \nand, (b) the belief in language as the most essential system through which humans construct reality (Leeds -Hurwitz, 2009). \n Vygotsky (1978) states that cog nitive growth occurs first on a social level, and then it can occur within the individual. To \nmake sense of others and construct knowledge on such a social level allow learners to relate themselves to circumstances. (Roth, \n2000).Roth also states that the r oots of individuals’ knowledge are found in their interactions with their surroundings and other \npeople before their knowledge is internalized.  \n According to Derry (1999) and McMahon (1997), culture and context in understanding what occurs in society and",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 34,
    "title": "Uploaded: reading1.pdf - Part 34",
    "content": "people before their knowledge is internalized.  \n According to Derry (1999) and McMahon (1997), culture and context in understanding what occurs in society and \nknowledge construction based on this understanding are emphasized in social constructivism.  \n Kim (2001) point out that social constructivism is based on specific assumptions about reality, knowledge, and learning .All \nof the mentioned assumptions is described in detail below: \n a. Reality: The first assumption of social constructivism is that reality does not exist in advance; instead it is constructe d \nthrough human activity. Kukla(2000) argues that members of a society or group together (and not individual)  invent the \nproperties of the world or group.  Furthermore, social constructivism believes that since reality is not made before social \ninvention, it is not something that can be discovered by individuals.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 35,
    "title": "Uploaded: reading1.pdf - Part 35",
    "content": "properties of the world or group.  Furthermore, social constructivism believes that since reality is not made before social \ninvention, it is not something that can be discovered by individuals. \n b. Knowledge: Social constructivism represents kn owledge as a human product that is socially and culturally constructed \n(Ernest, 1999; Gredler, 1997; Prat & Floden, 1994, cited in kim,2001). Individuals can create meaning when they interact with  \neach other and with the environment they live in. \n C. Learning: This assumption of Social constructivism stresses that learning is a social process. Learning does not take place \nonly within an individual, nor is it a passively developed by external forces (McMahon, 1997). Social constructivists state t hat \nmeaningful learning occurs when individuals are engaged in social activities such as interaction and collaboration.  \n \n2.2. Strong social construction versus Weak social construction",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 36,
    "title": "Uploaded: reading1.pdf - Part 36",
    "content": "meaningful learning occurs when individuals are engaged in social activities such as interaction and collaboration.  \n \n2.2. Strong social construction versus Weak social construction \n Smith (2010) critically analyzes various trends in sociology and distinguishes between “weak” and “strong” forms of social \nconstruction. Smith proposes that the former “need some maintenance” but the latter are “simply bankrupt” (134). Strong \nconstructionism is ultimately self-stultifying but managed to take hold in late modern tho ught because “conditions were ripe in \nthe last decades of the twentieth century for many people in particular knowledge class positions to want to believe it” (147 ). \n Against the strong theory and for the weak theory, Searle (1995, p.62) insists, \"it could  not be the case, as some have \nmaintained, that all facts are institutional [i.e., social] facts, that there are no brute facts, because the structure of in stitutional",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 37,
    "title": "Uploaded: reading1.pdf - Part 37",
    "content": "maintained, that all facts are institutional [i.e., social] facts, that there are no brute facts, because the structure of in stitutional \nfacts reveals that they are logically dependent on brute facts. To suppose that all facts are institutional [i.e., social] would produce \nan infinite regress or circularity in the account of institutional facts. In order that some facts are institutional, there must be other \nfacts that are brute [i.e., physical, biological, natural]. This is the consequence of the logical structure of institutional facts.\"",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 38,
    "title": "Uploaded: reading1.pdf - Part 38",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n14 | P a g e  \n \n \n2.3. Social constructivist view of learning \n Social constructivism, strongly influenced by Vygotsky's (1978) work, suggests that knowledge is first constructed in a \nsocial context and is then internalized and used by individuals (Bruning , 1999; M. Cole, 1991; Eggan & Kauchak, 2004). Social \nconstructivists believes that the process of sharing individual perspectives -called collaborative elaboration (Meter & Stevens, \n2000)-results in learners constructing understanding together and this construction cannot be possible alone within individuals \n(Greeno , 1996). Woolfolk (2010) represent a few strategies such as reciprocal questioning, jigsaw classroom, and structured \ncontroversies for cooperative learning.  \n Social constructivist scholars view learning as an active process where learners should learn to discover principles, concepts",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 39,
    "title": "Uploaded: reading1.pdf - Part 39",
    "content": "controversies for cooperative learning.  \n Social constructivist scholars view learning as an active process where learners should learn to discover principles, concepts \nand facts for themselves, hence they encourage and promote the guesswork and intuitive thinking  in learners (Brown 1989; \nAckerman 1996). In other words, social constructivist highlights that reality is not something that individuals can discover \nbecause it does not pre-exist prior to their social invention of it. Other constructivist scholars agree with this and emphasize that \nindividuals make meanings through the interactions with each other and with the environment they live in.  \n Moreover, Vygotsky (1978) believes that  learning is a continual movement from the current intellectual level to a high er \nlevel which more closely approximates the learner's potential. This movement occurs in the zone of proximal development (ZPD)",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 40,
    "title": "Uploaded: reading1.pdf - Part 40",
    "content": "level which more closely approximates the learner's potential. This movement occurs in the zone of proximal development (ZPD) \nas a result of social interaction. The zone of proximal development (ZPD) has been defined as \"the distance between the actual \ndevelopmental level as determined by independent problem solving and the level of potential development as determined through \nproblem solving under adult guidance, or in collaboration with more capable peers\" (Vygotsky, 1978, p. 86).Vygotsky \nemphasizes that human mental activity is a particular case of social experience. Thus, an understanding of human thinking and \nknowledge depends on an understanding of social experience and the force of the cognitive process derives from the social \ninteraction. \n \n2.4. Social constructivist view of teaching \n According to Shunk (2000) , social constructivist teaching approaches emphasize reciprocal teaching, peer collaboration,",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 41,
    "title": "Uploaded: reading1.pdf - Part 41",
    "content": "interaction. \n \n2.4. Social constructivist view of teaching \n According to Shunk (2000) , social constructivist teaching approaches emphasize reciprocal teaching, peer collaboration, \ncognitive apprenticeships, problem-based instruction, web quests, anchored instruction, and other methods that involve learning \nwith others .Instructional models based on the social constructivist perspective highlight the need for collaboration among \nlearners and with practitioners in the society (Lave & Wenger, 1991; McMahon, 1997). Lave and Wenger ( 1991) assert that the \nrelations among practitioners, their practice, and the social organization and political economy of communities of practice a re \nall important and effective in a society’s practical knowledge. For this reason, learning should involve s uch knowledge and \npractice (Lave & Wenger, 1991; Gredler, 1997).  \n \n2.5. Social constructivist view of learner",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 42,
    "title": "Uploaded: reading1.pdf - Part 42",
    "content": "practice (Lave & Wenger, 1991; Gredler, 1997).  \n \n2.5. Social constructivist view of learner \n According to Wertsch (1997) , social constructivism not only like constructivism acknowledges the uniqueness and \ncomplexity of the learner, but actually encourages, utilizes and rewards learner as an integral part of the learning process .Social \nconstructivism or socioculturalism encourages the learner’s own version of the truth that is influenced by his or her background, \nculture or knowledge of world. Social constructivism also stresses  the importance of the learner's social interaction with \nknowledgeable members of the society. Wertsch suggests that acquisition of social meaning of important symbol systems and \nlearning how to utilize them are dependent to social interaction with other more knowledgeable people. Also he adds that young \nchildren develop their thinking abilities through interaction with other children, adults and the physical world. From the so cial",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 43,
    "title": "Uploaded: reading1.pdf - Part 43",
    "content": "children develop their thinking abilities through interaction with other children, adults and the physical world. From the so cial \nconstructivist viewpoint, it is thus important to take into account the back ground and culture of the learner during learning \nprocess. The learner’s background also helps to shape the knowledge and truth that the learner creates, discovers and attains  in \nthe learning process. \n \n2.6. Social constructivist view of teacher \n According to the social constructivist approach, instructors in this approach are introduced as facilitators and not as teachers \n(Bauersfeld, 1995). Whereas a teacher gives a didactic lecture that covers the subject matter, a facilitator helps the learner to get \nto his or her own understanding of the content. The learner plays a passive role when the instructor just teaches, however th e \nlearner plays an active role when the instructor facilitat es the learning process and helps learners to learn. Gamoran, Secada, &",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 44,
    "title": "Uploaded: reading1.pdf - Part 44",
    "content": "learner plays an active role when the instructor facilitat es the learning process and helps learners to learn. Gamoran, Secada, & \nMarrett(1998) state that in social constructivism the emphasis turns away from the instructor and the content, and towards th e \nlearner. This significant change of instructor’s role ind icates that an instructor as facilitator needs to display a completely \ndifferent set of skills than that of an instructor as a teacher (Brownstein , 2001). To compare the role of teacher and that of \nfacilitator, Rhodes and Bellamy(1999) propose that a teacher tells, a facilitator asks; a teacher lectures from the front, a facilitator \nsupports from the back; a teacher gives answers according to a predetermined curriculum, a facilitator provides guidelines an d \ncreates the appropriate environment for the learn er to arrive at his or her own answer and conclusions; a teacher mostly gives a",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 45,
    "title": "Uploaded: reading1.pdf - Part 45",
    "content": "creates the appropriate environment for the learn er to arrive at his or her own answer and conclusions; a teacher mostly gives a \nmonologue, a facilitator is in continuous and interactive dialogue with the learners (Rhodes and Bellamy, 1999).",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 46,
    "title": "Uploaded: reading1.pdf - Part 46",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n15 | P a g e  \n According to Di Vesta (1987), the designed learning environment should both support and challenge the learner's thinking. \nWhile it is advocated to give the learner ownership of the problem and solution process, the instructors should consider that  not \nany activity or any solution is adequate. The critical and most i mportant goal is to help the learner in becoming an effective \nthinker. This goal can be achieved when instructors have multiple roles, such as consultant and coach.  \n \nConclusion  \n The research review suggests that the constructivist theory can reveal facts about education which were not represented in \ntraditional theories. Contrary to rote learning in the past, Merriam and Caffarella(1999) point out that constructivist learn ing is \na process of constructing meaning and  people themselves make sense of their experience. According to Piaget (1977), the role",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 47,
    "title": "Uploaded: reading1.pdf - Part 47",
    "content": "a process of constructing meaning and  people themselves make sense of their experience. According to Piaget (1977), the role \nof learners from passive in the past has changed to active in the constructivist theory.  \n Social constructivism which assumes that  cognitive growth first occurs on a social level and later on individual level \n,emphasizes the role of ZPD (Zone of proximal development) (Vygotsky, 1978).Thus instructors who are facilitators in social \nconstructivism first provide support and help for lea rners, the little by little this support is decreased and students learn \nindependently. \n Thus in social constructivist classrooms, students are actively involved, the environment is democratic, and interaction \nbecomes crucial in learning (Gray, 1997). \n The researchers suggest that with the importance given to collaboration, knowledge, and creativity through both social",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 48,
    "title": "Uploaded: reading1.pdf - Part 48",
    "content": "becomes crucial in learning (Gray, 1997). \n The researchers suggest that with the importance given to collaboration, knowledge, and creativity through both social \nconstructivism and constructivism; the learners can start learning in pair work, group work, and teamwork, and later make the ir \nown contributions to the world of knowledge. \n Finally, the researcher agrees with Vygotsky (1978) about cognitive growth from social to individual level, and the \nresearcher proposes that learning can be considered on a continuum from social constructivism to construct ivism. \n \nREFERENCES \n \nApplefield JM, Huber R & Moallem M. 2000. Constructivism in theory and practice: Toward a better understanding. The High School \nJournal, 35-53. \nBailey F & Pransky K. 2005. Are\" Other People's Children\" Constructivist Learners Too?. Theory into Practice, 44(1), 19-26. \nBauersfeld H. 1995. “Language Games’ in the Mathematics Classroom: Their Function and Their Effects”, in P. Cobb & H. Bauersfeld",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 49,
    "title": "Uploaded: reading1.pdf - Part 49",
    "content": "Bauersfeld H. 1995. “Language Games’ in the Mathematics Classroom: Their Function and Their Effects”, in P. Cobb & H. Bauersfeld \n(Eds.), The emergence of mathematical meaning: Interaction in classroom cultures, Hillsdale, US-NJ: Lawrence Erlbaum: 211-292. \nBelenky MF, Clinchy BM, Goldberger NR & Tarule JM. 1986. Women's ways of knowing: The development of self, voice, and mind. New \nYork: Basic Books.  \nBereiter C & Scardamilia M. 1985. Cognitive coping strategies and problems of “inert” knowledge. In S. Chipman, J. Seagal & R. Glaser \n(Eds.), Thinking and learning skills. Hillsdale, NY: Erlbaum. \nBrown AL. 1994. The advancement of learning. Educational researcher, 4-12. \nBrown AL, Ash D, Rutherford M, Nakagawa K, Gordon A & Campione JC. 1995. Distributed expertise in the classroom. In G. Salomon \n(Ed.), Distributed cognitions. New York: Cambridge University Press.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 50,
    "title": "Uploaded: reading1.pdf - Part 50",
    "content": "Brown AL, Ash D, Rutherford M, Nakagawa K, Gordon A & Campione JC. 1995. Distributed expertise in the classroom. In G. Salomon \n(Ed.), Distributed cognitions. New York: Cambridge University Press. \nBrown JS, Collins A & Duguid P. 1989. Situated cognition and the culture of learning. Educational researcher, 18(1), 32-42. \nBrownstein B. 2001. COLLABORATION: THE FOUNDATION OF LEARNING IN THE FUTURE. Education, 122(2). \nBruner JS. 1966b. Toward a theory of instruction. Cambridge, MA: The Belknap Press of Harvard University Press. \nBruner J. 1973. Going Beyond the Information Given. New York: Norton. \nCaffarella RS & Merriam SB. 1999. Perspectives on adult learning: framing our research. In 40th Annual Adult Education Research \nConference Proceedings. Northern Illinois University. \nCarpenter T & Fennema E. 1992. Cognitively guided instruction: Building on the knowledge of students and teachers. International Journal \nof Educational Research 17: 475-470.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 51,
    "title": "Uploaded: reading1.pdf - Part 51",
    "content": "Carpenter T & Fennema E. 1992. Cognitively guided instruction: Building on the knowledge of students and teachers. International Journal \nof Educational Research 17: 475-470. \nChristie A. 2005. Constructivism and its implications for educators. Retrieved April, 20, 2013. \nClements DH. 1997. (Mis?) Constructing Constructivism. Teaching children mathematics, 4(4), 198-200. \nCobb P. 1994. Constructivism in mathematics and science education. Educational Researcher 23: 4. \nCooper PA. 1993. Paradigm Shifts in Designed Instruction: From Behaviorism to Cognitivism to Constructivism. Educational \ntechnology, 33(5), 12-19. \nCook J. 1992. Negotiating the curriculum: Programming for learning.Negotiating the curriculum: educating for the 21st century, 15-31. \nDerry SJ. 1999. A fish called peer learning: Searching for common themes.Cognitive perspectives on peer learning, 197-211.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 52,
    "title": "Uploaded: reading1.pdf - Part 52",
    "content": "Derry SJ. 1999. A fish called peer learning: Searching for common themes.Cognitive perspectives on peer learning, 197-211. \nDi Vesta FJ. 1987. The cognitive movement and education. In J. A. Golver & R.R. Ronning (Eds.), Historical foundations of educational \npsychology (pp. 37-63). New York: Plenum Press. \nDuffy TM & Jonasse DH. 1991. “New Implications for Instructional Technology”. Educational Technology, May 1991. \nDuffy G, Roehler L & Radcliff G. 1986. How teachers’ instructional talk influences students’ understanding of lesson content. Elementary \nSchool Journal 87: 3-16. \nErnest P. 1999. Social Constructivism as a Philosophy of Mathematics: Radical Constructivism \nErdem E. 2001. Program gelistirmede yapilandirmacilik yaklasum. (Constructivist approach in curriculum development). Unpublished \nmaster thesis. Hacettepe Univerisity, Ankara.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 53,
    "title": "Uploaded: reading1.pdf - Part 53",
    "content": "J Soci Sci, Lit & Lang., 1 (1): 9-16, 2015 \n16 | P a g e  \nGamoran A, Secada WG & Marrett CB. 2000. The organizational context of teaching and learning. In Handbook of the sociology of \neducation(pp. 37-63). Springer US. \nGiroux H. 1986. The politics of schooling and culture. Orbit, 17(4),10-11. \nGray A. 1997. Contructivist teaching and learning. SSTA Research Centre Report, 97-07. \nGredler ME. 1997. Learning and instruction: Theory into practice (3rd ed). Upper Saddle River, NJ: Prentice-Hall. \nGruber HE & Voneche JJ. 1977. The essential Piaget. New York: Basic Books. \nest donc le vrai Piaget Q & Papert S. 1982. An interpretation of Piaget’s constructivism. Revue internationale de philosophie, 36(4), 612-\n635. \nHare D, Howard E & Pope M. 2005. Enhancing technology use in student teaching: A case study. Journal of Technology and Teacher \nEducation, 13(4), p. 573+. \nHoover WA. 1996. The practice implications of constructivism. SEDL Letter, 9(3), 1-2.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 54,
    "title": "Uploaded: reading1.pdf - Part 54",
    "content": "Education, 13(4), p. 573+. \nHoover WA. 1996. The practice implications of constructivism. SEDL Letter, 9(3), 1-2. \nKanselaar G. 2002. Constructivism and socio-constructivism. Article published on July, 16, 2002. \nKim B. 2001. Social constructivism. Emerging perspectives on learning, teaching, and technology, 1-8. \nKukla A. 2000. Social constructivism and the philosophy of science. Psychology Press. \nLave J & Wenger E. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press. \nLeeds-Hurwitz W. 2009. Social construction of reality. Encyclopedia of communication theory, 892-895. \nLester NB & Onore CS. 1990. Learning Change: One school district meets language across the curriculum. Portsmith, NH: Boynton/Cook \nPublishers.  \nMcMahon M. 1997. Social Constructivism and the World Wide Web - A Paradigm for Learning. Paper presented at the ASCILITE \nconference. Perth, Australia.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 55,
    "title": "Uploaded: reading1.pdf - Part 55",
    "content": "Publishers.  \nMcMahon M. 1997. Social Constructivism and the World Wide Web - A Paradigm for Learning. Paper presented at the ASCILITE \nconference. Perth, Australia. \nMezirow J. 1990. How critical reflection triggers transformative learning. Fostering critical reflection in adulthood, 1-20. \nMoshman D. 1982. Exogenous,  endogenous, and dialectical constructivism. Developmental Review 2:371-384. \nMvududu NH & Thiel-Burgess J. 2012. Constructivism in Practice: The Case for English Language Learners. International Journal of \nEducation, 4(3), p108-p118. \nNeale D, Smith D &  Johnson V. 1990. Implementing conceptional change teaching in primary science. Elementary School Journal 91: 109-\n132.  \nPerkins DN. 1992. Technology meets constructivism: Do they make a marriage. Constructivism and the technology of instruction: A \nconversation, 45-55. \nPiaget J & Inhelder B. 1969. The psychology of the child. New York: Basic Books. \nPiaget J. 1970. Structuralism. New York: Basic Books.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 56,
    "title": "Uploaded: reading1.pdf - Part 56",
    "content": "conversation, 45-55. \nPiaget J & Inhelder B. 1969. The psychology of the child. New York: Basic Books. \nPiaget J. 1970. Structuralism. New York: Basic Books. \nPiaget J. 1973. To understand is to invent: The future of education. \nPiaget J. 1977. The development of thought: Equilibration of cognitive structures. (A. Rosin, Trans). New York: The Viking Press. \nPhillips DC. 2000. Constructivism in Education: Opinions and Second Opinions on Controversial Issues. Ninety-Ninth Yearbook of the \nNational Society for the Study of Education. University of Chicago Press, Order Dept., 11030 South Langley Avenue, Chicago, IL \n60628. \nPrawat RS. 1992. Teachers' beliefs about teaching and learning: A constructivist perspective. American journal of education, 354-395. \nLeeds-Hurwitz W. 2009. Social construction of reality. Encyclopedia of communication theory, 892-895. \nRhodes LK & Belly GT. 1999. Choices and Consequences in the Renewal of Teacher Education. Journal of Teacher Education, 50(1), 17.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 57,
    "title": "Uploaded: reading1.pdf - Part 57",
    "content": "Rhodes LK & Belly GT. 1999. Choices and Consequences in the Renewal of Teacher Education. Journal of Teacher Education, 50(1), 17. \nRogoff B. 1998. Cognition as a collaborative process. In W. Damon, D. Kuhn& R.S. Seigler (Eds.), Handbook of child psychology (5th ed., \nVol.2).New York: Wiley. \nRoth WM. 2000. in McCormick, R. and Paechter, C. (eds), “Authentic School Science: Intellectual Traditions”, Learning & Knowledge, \nLondon, UK: Paul Chapman Publishing: 6-20. \nSearle JR. 1995. The construction of social reality. Simon and Schuster. \nShunk DH. 2000. Learning theories: An educational perspective (3rd ed). Upper Saddle River, NJ: Prentice-Hall.  \nSmith C. 2010. What is a person?: Rethinking humanity, social life, and the moral good from the person up. University of Chicago Press. \nTwomey Fosnot C. 1989. Enquiring teachers, enquiring learners: A constructivist approach for teaching. New York: Teachers College Press.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  },
  {
    "id": 58,
    "title": "Uploaded: reading1.pdf - Part 58",
    "content": "Twomey Fosnot C. 1989. Enquiring teachers, enquiring learners: A constructivist approach for teaching. New York: Teachers College Press.  \nVygotsky LS. 1978. Mind in society. Cambridge: Harvard University Press. \nVygotsky L. 1986. Thought and Language. Transl. and ed. A. Kozulin. Cambridge, MA: The MIT Press. (Originally published in Russian in \n1934.) \nWadsworth BJ. 1996. Piaget's theory of cognitive and affective development: Foundations of constructivism . Longman Publishing. \nWertsch JV. 1997. Vygotsky and the formation of the mind. Cambridge, MA.",
    "author": "Uploaded Content",
    "type": "uploaded_file"
  }
]